<template>
  <div class="bg-black3 pt-50 relative-position">
    <img
      src="src/assets/plusesBenefits.svg"
      style="position: absolute; bottom: 0; left: 17%"
    />
    <div style="height: 625px" class="c-container">
      <div
        style="overflow: hidden; height: inherit"
        class="row full-width no-wrap"
      >
        <div class="col column gap-25 pr-20">
          <div class="mega-text bold">
            Что вы получите, используя решения от Loyalhub?
          </div>
          <FunButton
            @click="store.requestModal = true"
            label="Подобрать решение"
          />
        </div>
        <div style="overflow-y: auto" class="col-6 column gap-6 no-wrap pb-20">
          <div
            v-for="(el, index) in blocks"
            :key="index"
            class="rounded-40 bg-white text-black py-10 px-15 column no-wrap full-height gap-2"
          >
            <div class="row full-width gap-6 no-wrap">
              <div class="mega-text2 bold">{{ el.number }}</div>
              <div class="header-text bold mt-4">{{ el.title }}</div>
            </div>
            <div class="body" v-html="el.text"></div>
          </div>
        </div>
      </div>
    </div>
  </div>
</template>
<script lang="ts" setup>
import FunButton from 'src/components/templates/buttons/FunButton.vue';
import { store } from 'src/models/store';

const blocks = [
  {
    number: '01',
    title: 'Бесплатный запуск',
    text: 'Благодаря нашему удобному приложению, вы сможете:<ul><li>изучать меню, оформлять доставку или самовывоз</li><li>получать уведомления</li><li>пользоваться бонусной системой</li><li>оставлять отзывы о работе заведения.</li></ul>',
  },
  {
    number: '02',
    title: 'Полная интеграция с iiko',
    text: 'Получайте заказы сразу, собирайте данные о гостях, настраивайте систему лояльности и копите статистику, собранную через доступные вам инструменты сразу в своей учетной системе.',
  },
  {
    number: '03',
    title: 'Удобная работа с заказами',
    text: 'Ваши гости смогут самостоятельно формировать и оплачивать заказы через СБП.<br/>Подключение к системе онлайн-оплаты позволит гостям не только формировать, но и оплачивать выбранные позиции.',
  },
  {
    number: '04',
    title: 'Экономию на эквайринге',
    text: 'При подключении линейки Loyalhub 80% платежей будет проходить через СБП. Быстрое подключение без открытия дополнительных расчетных счетов.',
  },
  {
    number: '05',
    title: 'Оцифрованные данные',
    text: 'Получайте все данные о ваших гостях сразу в iiko, формируйте olap-отчеты , анализируйте продажи и изучайте свою целевую аудиторию.',
  },
  {
    number: '06',
    title: 'Инструменты для увеличения среднего чека',
    text: 'Встроенные конфигураторы позволяют гостю модифицировать блюдо, добавляя различные начинки.<br/>Кроме этого, на увеличение среднего чека будут совместно работать система рекомендаций и допродажи в корзине.',
  },
  {
    number: '07',
    title: 'Бонусы, скидки, уведомления, новости',
    text: 'Встроенные конфигураторы позволяют гостю модифицировать блюдо, добавляя различные начинки.<br/>Кроме этого, на увеличение среднего чека будут совместно работать система рекомендаций и допродажи в корзине.',
  },
  {
    number: '08',
    title: 'CRM-систему',
    text: 'Анализируйте продажи, стройте отчеты, изучайте эффективность PUSH-мероприятий, взаимодействуйте с гостями и координируйте бизнес-процессы. Все данные, собранные благодаря инструментам Loyalhub, будут агрегироваться в одном месте. Изучайте их, чтобы открыть новые точки роста для вашего бизнеса.',
  },
  {
    number: '09',
    title: 'Управление репутацией',
    text: 'Собирайте отзывы на работу заведения в собственном канале, контролируйте отзывы, улучшайте работу заведения и управляйте репутацией на рынке. Обрабатывайте негатив на собственной площадке и минимизируйте риски появления негативных отзывов на сторонних площадках.',
  },
  {
    number: '10',
    title: 'Регулярные обновления',
    text: 'В рамках ежемесячной абонентской платы вы будете получать предложения по внедрению лучших техник и инструментов для увеличения продаж. Мы сами отследим тренды и предложим вам то, что сделает работу вашего приложения эффективнее, а ваш бизнес прибыльнее',
  },
  {
    number: '11',
    title: 'Объединение заведений в одной системе лояльности',
    text: 'Обменивайтесь гостями между точками от одного собственника: общие бонусы, новостные рассылки и предложения – все это замотивирует гостей совершать покупки внутри вашей сети заведений',
  },
];
</script>
